<a href="https://colab.research.google.com/github/aditimankar10/Categorical-Variable-Encoding/blob/main/HandlingCategoricalValues.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#### ORDINAL NUMBER ENCODING

In [2]:
import datetime

In [3]:

today_date=datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2021, 5, 27, 17, 2, 19, 442911)

In [5]:
today_date-datetime.timedelta(3)

datetime.datetime(2021, 5, 24, 17, 2, 19, 442911)

In [6]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [7]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [8]:
data.head()

                         Day
0 2021-05-27 17:02:19.442911
1 2021-05-26 17:02:19.442911
2 2021-05-25 17:02:19.442911
3 2021-05-24 17:02:19.442911
4 2021-05-23 17:02:19.442911

In [9]:
data['weekday_name']=data['Day'].dt.strftime("%A")
data.head()

                         Day weekday_name
0 2021-05-27 17:02:19.442911     Thursday
1 2021-05-26 17:02:19.442911    Wednesday
2 2021-05-25 17:02:19.442911      Tuesday
3 2021-05-24 17:02:19.442911       Monday
4 2021-05-23 17:02:19.442911       Sunday

In [10]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [11]:
dictionary

{'Friday': 5,
 'Monday': 1,
 'Saturday': 6,
 'Sunday': 7,
 'Thursday': 4,
 'Tuesday': 2,
 'Wednesday': 3}

In [12]:
data['weekday_ordinal']=data['weekday_name'].map(dictionary)

In [13]:
data

                          Day weekday_name  weekday_ordinal
0  2021-05-27 17:02:19.442911     Thursday                4
1  2021-05-26 17:02:19.442911    Wednesday                3
2  2021-05-25 17:02:19.442911      Tuesday                2
3  2021-05-24 17:02:19.442911       Monday                1
4  2021-05-23 17:02:19.442911       Sunday                7
5  2021-05-22 17:02:19.442911     Saturday                6
6  2021-05-21 17:02:19.442911       Friday                5
7  2021-05-20 17:02:19.442911     Thursday                4
8  2021-05-19 17:02:19.442911    Wednesday                3
9  2021-05-18 17:02:19.442911      Tuesday                2
10 2021-05-17 17:02:19.442911       Monday                1
11 2021-05-16 17:02:19.442911       Sunday                7
12 2021-05-15 17:02:19.442911     Saturday                6
13 2021-05-14 17:02:19.442911       Friday                5
14 2021-05-13 17:02:19.442911     Thursday                4

In [14]:
#### FREQUENCY/COUNT ENCODING

In [15]:
import pandas as pd
from google.colab import files
uploaded = files.upload()

Saving titanic.csv to titanic (2).csv

In [16]:
df=pd.read_csv('titanic.csv', usecols=['Sex','Fare'])
df.head()

      Sex     Fare
0    male   7.2500
1  female  71.2833
2  female   7.9250
3  female  53.1000
4    male   8.0500

In [17]:
df1=df.groupby('Fare').size()/len(df)
df.loc[:, 'Fare_map']=df['Fare'].map(df1)
df

        Sex     Fare  Fare_map
0      male   7.2500  0.014590
1    female  71.2833  0.001122
2    female   7.9250  0.020202
3    female  53.1000  0.005612
4      male   8.0500  0.048260
..      ...      ...       ...
886    male  13.0000  0.047138
887  female  30.0000  0.006734
888  female  23.4500  0.002245
889    male  30.0000  0.006734
890    male   7.7500  0.038159

[891 rows x 3 columns]

In [18]:
#### TARGET GUIDED ENCODING

In [19]:
import pandas as pd
df=pd.read_csv('titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [20]:
df['Cabin'].fillna('Missing',inplace=True)

In [21]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [22]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [23]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [24]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [25]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [26]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [27]:
#### MEAN ENCODING

In [28]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [29]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [30]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

In [31]:
#### PROBABILITY RATIO ENCODING

In [32]:
df=pd.read_csv('titanic.csv', usecols=['Survived', 'Cabin'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [33]:
df['Cabin'].fillna('Missing', inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [34]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [35]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [36]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [37]:
prob_df = df.groupby(['Cabin'])['Survived'].mean()

In [38]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [39]:
prob_df['Died']=1-prob_df['Survived']

In [40]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [41]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [42]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [43]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274

In [44]:
#### ONE HOT ENCODIND

In [45]:
import pandas as pd

In [46]:
df=pd.read_csv('titanic.csv',usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [47]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [48]:
df=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [49]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [50]:
df.dropna(inplace=True)

In [51]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [52]:
##### ONEHOT ENCODING WITH VARIABLE CATEGORIES IN THE FEATURE

In [53]:
df=pd.read_csv('titanic.csv', usecols=['Age','Fare','Survived', 'Embarked'])
df.head()

   Survived   Age     Fare Embarked
0         0  22.0   7.2500        S
1         1  38.0  71.2833        C
2         1  26.0   7.9250        S
3         1  35.0  53.1000        S
4         0  35.0   8.0500        S

In [54]:
for i in df.columns:
    print(len(df[i].unique()))

2
89
248
4

In [55]:

df.Age.value_counts().sort_values(ascending=False).head(10)

24.0    30
22.0    27
18.0    26
19.0    25
30.0    25
28.0    25
21.0    24
25.0    23
36.0    22
29.0    20
Name: Age, dtype: int64

In [56]:
lst_10=df.Age.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [57]:
lst_10

[24.0, 22.0, 18.0, 19.0, 30.0, 28.0, 21.0, 25.0, 36.0, 29.0]

In [58]:
import numpy as np
for categories in lst_10:
    df[categories]=np.where(df['Age']==categories,1,0)

In [59]:
lst_10.append('Age')
df[lst_10]

     24.0  22.0  18.0  19.0  30.0  28.0  21.0  25.0  36.0  29.0   Age
0       0     1     0     0     0     0     0     0     0     0  22.0
1       0     0     0     0     0     0     0     0     0     0  38.0
2       0     0     0     0     0     0     0     0     0     0  26.0
3       0     0     0     0     0     0     0     0     0     0  35.0
4       0     0     0     0     0     0     0     0     0     0  35.0
..    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
886     0     0     0     0     0     0     0     0     0     0  27.0
887     0     0     0     1     0     0     0     0     0     0  19.0
888     0     0     0     0     0     0     0     0     0     0   NaN
889     0     0     0     0     0     0     0     0     0     0  26.0
890     0     0     0     0     0     0     0     0     0     0  32.0

[891 rows x 11 columns]